<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 1', 
            'price' => '400', 
            'image' => '/web/images/p1.png', 
            'weight' => '40', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 2', 
            'price' => '500', 
            'image' => '/web/images/p2.png', 
            'weight' => '20', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 3 ', 
            'price' => '600', 
            'image' => '/web/images/p3.png', 
            'weight' => '80', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 4', 
            'price' => '700', 
            'image' => '/web/images/p4.png', 
            'weight' => '80', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 5', 
            'price' => '800', 
            'image' => '/web/images/p5.png', 
            'weight' => '67', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 6', 
            'price' => '900', 
            'image' => '/web/images/p6.png', 
            'weight' => '79', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 7', 
            'price' => '300', 
            'image' => '/web/images/p7.png', 
            'weight' => '45', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 8', 
            'price' => '250', 
            'image' => '/web/images/p8.png', 
            'weight' => '56', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 9', 
            'price' => '1000', 
            'image' => '/web/images/p9.png', 
            'weight' => '34', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 10', 
            'price' => '456', 
            'image' => '/web/images/p10.png', 
            'weight' => '23', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 11', 
            'price' => '458', 
            'image' => '/web/images/p11.png', 
            'weight' => '44', 
            
            
        ]);

        $company = Product::create([

            'description' => 'تأسست شركة  للصيانة والخدمات في عام 2010 وتتحمل مسؤولية تطوير الشكل العام للخدمةمنذ ذلك الوقت ، زادت قوتنا البشرية ومرافقنا لتنفيذ نوع متقدم جدًا من المهام الهندسية الفريدة لجميع عملائنا مثل تصميم وتوريد وتركيب وصيانة الأنظمة الكهربائية والميكانيكية والتصميم والتوريد والتركيب واختبار التحكم و أنظمة المراقبة وتصميم وتوريد وتركيب الألمنيوم والكلايد.',
            'name' => 'منتج رقم 12', 
            'price' => '450', 
            'image' => '/web/images/p12.png', 
            'weight' => '50', 
            
            
        ]);
    }
}
